The connector width, Units:(ft).
  Namespace:   Autodesk.Revit.DB.Plumbing
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public double Width { get; }
  Visual Basic
Public ReadOnly Property Width As Double
	Get
  Visual C++
public:
property double Width {
	double get ();
}
 See Also
  PipeFittingAndAccessoryConnectorData Class
  Autodesk.Revit.DB.Plumbing Namespace